// Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B. 
// Не использовать метод Math.Pow

// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16


// Console.WriteLine("Введите число А");
// int A = int.Parse(Console.ReadLine());
// Console.WriteLine("Введите число B");
// int B = int.Parse(Console.ReadLine());

// int extent = A;

// for (int i = 1; i < B; i++)
// {
// extent = extent * A;
// }
// Console.WriteLine("A в степени B равно: " + extent);

// ________________________________________________________________

// Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

// 452 -> 11

// 82 -> 10

// 9012 -> 12